<?php

declare(strict_types=1);

namespace Myers;

use PHPUnit\Framework\TestCase;

class CheckTest extends TestCase
{
    /**
     * @test
     * @dataProvider apply_dp
     */
    public function apply(string $v, string $exp)
    {
        // 必要だと考えたテストを実装する
        // テストメソッドを分けたりしても良い
        $this->assertSame($exp, Checker::apply($v));
    }

    function apply_dp(): array
    {
        return [
            '正三角形のパターン 1' => ['3 3 3', '正三角形'],
//            '正三角形のパターン 2' => ['5 5 5', '正三角形'],
            '二等辺三角形のパターン 1' => ['3 3 5', '二等辺三角形'],
            '二等辺三角形のパターン 2' => ['4 5 5', '二等辺三角形'],
            '二等辺三角形のパターン 3' => ['4 6 4', '二等辺三角形'],
            '不等辺三角形のパターン 1' => ['3 4 5', '不等辺三角形'],
            '不等辺三角形のパターン 2' => ['5 8 4', '不等辺三角形'],
            '不等辺三角形のパターン 3' => ['10 7 5', '不等辺三角形'],
            '三角形を作れない 1' => ['-1 4 5', '不成立'],
            '三角形を作れない 2' => ['1 -4 5', '不成立'],
            '三角形を作れない 3' => ['3 4 -5', '不成立'],
            '三角形を作れない 4' => ['0 6 9', '不成立'],
            '三角形を作れない 5' => ['5 0 5', '不成立'],
            '三角形を作れない 6' => ['-1 4 0', '不成立'],
            '三角形を作れない 7' => ['0 0 0', '不成立'],
            '三角形を作れない 8' => ['3 4 7', '不成立'],
            '三角形を作れない 9' => ['3 8 5', '不成立'],
            '三角形を作れない 10' => ['12 5 7', '不成立'],
            '三角形を作れない 11' => [' ', '不成立'],
        ];
    }
}
